# Imports

In [1]:
# Importing Libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [214]:
path = r"C:\Users\malac\Downloads\Realtor.com cf"

In [215]:
path

'C:\\Users\\malac\\Downloads\\Realtor.com cf'

In [217]:
# Importing dataset as df

df = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'realtor-dataset-100k.csv'))

# Data Wrangling

## A. Changing Data Types and Dropping NaNs

In [ ]:
# Checking the shape of df

df.shape

(100000, 12)

In [ ]:
# Checking data types

df.dtypes

status           object
price             int64
bed             float64
bath            float64
acre_lot        float64
full_address     object
street           object
city             object
state            object
zip_code        float64
house_size      float64
sold_date        object
dtype: object

In [13]:
# Checking data types closer

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 12 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   status        100000 non-null  object
 1   price         100000 non-null  int64
 2   bed           75050 non-null   float64
 3   bath          75112 non-null   float64
 4   acre_lot      85987 non-null   float64
 5   full_address  100000 non-null  object
 6   street        99916 non-null   object
 7   city          99948 non-null   object
 8   state         100000 non-null  object
 9   zip_code      99805 non-null   float64
 10  house_size    75082 non-null   float64
 11  sold_date     28745 non-null   object
dtypes: float64(5), int64(1), object(6)
memory usage: 9.2+ MB

## All 5 of the float64 dtypes need to be changed to int64. First I need to check values, and remove any NaNs, then change string type.

In [15]:
# Check values

df['bed'].value_counts(dropna = False)

3.0     30518
NaN     24950
4.0     16850
2.0     11734
5.0      5359
6.0      3814
1.0      2088
7.0      1551
8.0      1120
9.0       821
10.0      385
12.0      280
11.0      136
20.0       68
15.0       56
13.0       54
18.0       44
14.0       39
28.0       28
19.0       27
24.0       24
16.0       19
17.0       10
33.0       10
86.0        5
31.0        4
40.0        3
21.0        2
27.0        1
Name: bed, dtype: int64

In [40]:
# Removing NaNs from bed

df.dropna(subset = ['bed'], inplace = True)

In [41]:
# Change dtype to int64

df['bed'] = df['bed'].astype('int64')

In [43]:
# Check shape

df.shape

(75050, 12)

In [23]:
# Check values

df['bath'].value_counts(dropna = False)

2.0     31071
NaN     24888
3.0     17265
1.0     15389
4.0      6346
5.0      2429
6.0      1231
7.0       460
8.0       332
9.0       221
10.0      105
12.0       63
16.0       47
13.0       37
15.0       33
20.0       31
18.0       23
11.0        9
14.0        7
56.0        5
36.0        3
19.0        2
35.0        1
25.0        1
17.0        1
Name: bath, dtype: int64

In [44]:
# Remving NaNs from bath

df.dropna(subset = ['bath'], inplace = True)

In [45]:
# Change dytpe to int64

df['bath'] = df['bath'].astype('int64')

In [46]:
# Check shape

df.shape

(74826, 12)

In [26]:
# Check values

df['acre_lot'].value_counts(dropna = False)

NaN       14013
0.09       2225
0.11       2202
0.08       2001
0.23       1902
          ...
200.00        1
114.20        1
123.47        1
44.00         1
2.86          1
Name: acre_lot, Length: 1614, dtype: int64

In [49]:
# Removing NanNs from acre lot

df.dropna(subset = ['acre_lot'], inplace = True)

In [50]:
# Change dtype to int64

df['acre_lot'] = df['acre_lot'].astype('int64')

In [51]:
# Check shape

df.shape

(61317, 12)

In [62]:
# Check values

df['zip_code'].value_counts(dropna = False)

1201    1607
6082     933
926      872
1040     742
1420     715
        ...
5355       1
3457       1
5158       1
3445       1
2048       1
Name: zip_code, Length: 708, dtype: int64

In [55]:
# Removing NaNs from zip code

df.dropna(subset = ['zip_code'], inplace = True)

In [56]:
# Change dtype to int64

df['zip_code'] = df['zip_code'].astype('int64')

In [57]:
# Check shape

df.shape

(61238, 12)

In [63]:
# Check values

df['house_size'].value_counts(dropna = False)

1000    563
1200    551
2500    496
2000    493
1500    470
       ...
4117      1
5309      1
1837      1
7665      1
1727      1
Name: house_size, Length: 3360, dtype: int64

In [59]:
# Removing NaNs from house size

df.dropna(subset = ['house_size'], inplace = True)

In [60]:
# Change dtype to int64

df['house_size'] = df['house_size'].astype('int64')

In [61]:
# Check shape

df.shape

(60671, 12)

In [67]:
# Checking all columns

df.head()

,status,price,bed,bath,acre_lot,full_address,street,city,state,zip_code,house_size,sold_date
0,for_sale,105000,3,2,0,"Sector Yahuecas Titulo # V84, Adjuntas, PR, 00601",Sector Yahuecas Titulo # V84,Adjuntas,Puerto Rico,601,920,NaN
1,for_sale,80000,4,2,0,"Km 78 9 Carr # 135, Adjuntas, PR, 00601",Km 78 9 Carr # 135,Adjuntas,Puerto Rico,601,1527,NaN
2,for_sale,67000,2,1,0,"556G 556-G 16 St, Juana Diaz, PR, 00795",556G 556-G 16 St,Juana Diaz,Puerto Rico,795,748,NaN
3,for_sale,145000,4,2,0,"R5 Comunidad El Paraso Calle De Oro R-5 Ponce,...",R5 Comunidad El Paraso Calle De Oro R-5 Ponce,Ponce,Puerto Rico,731,1800,NaN
5,for_sale,179000,4,3,0,"Bo Calabazas San Sebastian, San Sebastian, PR,...",Bo Calabazas San Sebastian,San Sebastian,Puerto Rico,612,2520,NaN

## The sold_date column still has NaNs but it represents houses that have never been sold and not missing data.

## B. Dropping and Renaming Columns

In [70]:
# Dropping columns that contain PII data, but will keep addresses for geospatial visualizations later

df_2 = df.drop(['full_address', 'street', 'city', 'zip_code'], axis = 1)

In [73]:
# Checking all columns

df_2.head()

     status   price  bed  bath  acre_lot        state  house_size sold_date
0  for_sale  105000    3     2         0  Puerto Rico         920       NaN
1  for_sale   80000    4     2         0  Puerto Rico        1527       NaN
2  for_sale   67000    2     1         0  Puerto Rico         748       NaN
3  for_sale  145000    4     2         0  Puerto Rico        1800       NaN
5  for_sale  179000    4     3         0  Puerto Rico        2520       NaN

# Cleaning Data

## A. Duplicates

In [81]:
# Finding Dups

df_dups = df_2[df_2.duplicated()]

In [82]:
df_dups

,status,price,bed,bath,acre_lot,state,house_size,sold_date
135,for_sale,105000,3,2,0,Puerto Rico,1500,NaN
139,for_sale,300000,5,3,7,Puerto Rico,5403,NaN
140,for_sale,155000,3,2,0,Puerto Rico,4161,NaN
148,for_sale,122500,3,2,0,Puerto Rico,1118,NaN
149,for_sale,575000,3,2,3,Puerto Rico,4000,NaN
...,...,...,...,...,...,...,...,...
99994,for_sale,385000,2,2,1,Massachusetts,1225,NaN
99996,for_sale,349900,2,1,0,Massachusetts,1075,6/7/1999
99997,for_sale,549000,3,2,1,Massachusetts,1632,9/27/1995
99998,for_sale,299000,3,2,0,Massachusetts,1332,9/11/2000
99999,for_sale,535000,3,3,21,Massachusetts,1846,10/6/2020

In [99]:
# Removing dups in new df

df_3 = df_2.drop_duplicates()

## B. Mixed Data

In [100]:
# Checking mixed data types

for col in df_2.columns.tolist():
  weird = (df_2[[col]].applymap(type) != df_2[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_2[weird]) > 0:
    print (col)

sold_date

That is okay because we have already addressed the NaNs in this column are essential to this analysis.

## C. Missing Data

In [101]:
# Check for missing data

df_3.isnull().sum()

status           0
price            0
bed              0
bath             0
acre_lot         0
state            0
house_size       0
sold_date     4932
dtype: int64

## No missing data

# Descriptive Analysis

In [102]:
# Run basic analysis of all columns

df_3.describe()

              price          bed         bath       acre_lot    house_size
count  9.288000e+03  9288.000000  9288.000000    9288.000000  9.288000e+03
mean   5.891960e+05     3.874892     2.644488      16.717593  2.526759e+03
std    1.241282e+06     2.049475     1.685901    1045.795633  1.514505e+04
min    1.000000e+04     1.000000     1.000000       0.000000  1.810000e+02
25%    2.399000e+05     3.000000     2.000000       0.000000  1.296000e+03
50%    3.499435e+05     3.000000     2.000000       0.000000  1.870000e+03
75%    5.549250e+05     4.000000     3.000000       1.000000  2.856000e+03
max    6.000000e+07    86.000000    56.000000  100000.000000  1.450112e+06

In [103]:
# View in Excel 

df_2.describe().to_clipboard()

## Perform value count of all columns

In [104]:
# Check value of price

df_3['price'].value_counts(dropna = False)

299900     149
399900     121
349900     117
249900     110
325000      87
          ...
186829       1
946000       1
193500       1
587000       1
1479900      1
Name: price, Length: 1499, dtype: int64

In [105]:
# Check value of bedrooms

df_3['bed'].value_counts(dropna = False)

3     3925
4     2494
2      876
5      735
6      557
7      188
8      156
9      119
1      113
10      44
12      26
11      17
13       7
14       5
15       5
18       4
20       3
33       2
19       2
21       2
40       1
31       1
86       1
24       1
17       1
16       1
28       1
27       1
Name: bed, dtype: int64

Not sure why so many houses with high number of bedrooms, I am assuming these to by typos and will change for more clean analysis. I will correct all the items with less than 10 entries. For exapmle, 86 bedrooms will be change to 8 bathrooms, 40 bedrooms to 4 bedrooms etc.

In [107]:
# Checking listing with 86 bedroooms

df_3.loc[df_3['bed'] == 86]

,status,price,bed,bath,acre_lot,state,house_size,sold_date
80518,for_sale,15150000,86,56,1,Massachusetts,35666,NaN

In [109]:
# Replacing 86 with 8 bedrooms

df_3.loc[df_3['bed'] == 86, 'bed'] = 8

In [112]:
# Replacing 28 with 3 bedrooms

df_3.loc[df_3['bed'] == 28, 'bed'] = 3

In [113]:
# Replacing 40 with 4 bedrooms

df_3.loc[df_3['bed'] == 40, 'bed'] = 4

In [115]:
# Replacing 31 with 3 bedrooms

df_3.loc[df_3['bed'] == 31, 'bed'] = 3

In [116]:
# Replacing 33 with 3 bedrooms

df_3.loc[df_3['bed'] == 33, 'bed'] = 3

In [117]:
# Replacing 27 wtih 2

df_3.loc[df_3['bed'] == 27, 'bed'] = 3

In [127]:
# Replacing 24 with 2

df_3.loc[df_3['bed'] == 24, 'bed'] = 2

In [128]:
# Replacing 21 with 2

df_3.loc[df_3['bed'] == 21, 'bed'] = 2

In [129]:
# Replacing 20 with 2

df_3.loc[df_3['bed'] == 20, 'bed'] = 2

In [130]:
# Replacing 19 with 2 

df_3.loc[df_3['bed'] == 19, 'bed'] = 2

In [131]:
# Replacing 18 with 2 

df_3.loc[df_3['bed'] == 18, 'bed'] = 2

In [132]:
# Replacing 17 with 2

df_3.loc[df_3['bed'] == 17, 'bed'] = 2

In [133]:
# Replacing 15 with 2

df_3.loc[df_3['bed'] == 15, 'bed'] = 2

In [134]:
# Replacing 14 with 1

df_3.loc[df_3['bed'] == 14, 'bed'] = 1

In [135]:
# Replacing 13 with 1

df_3.loc[df_3['bed'] == 13, 'bed'] = 1

In [136]:
# Replacing 12 with 1

df_3.loc[df_3['bed'] == 12, 'bed'] = 1

In [138]:
# Replacing 16 with 2

df_3.loc[df_3['bed'] == 16, 'bed'] = 2

In [140]:
# Replacing 11 with 1

df_3.loc[df_3['bed'] == 11, 'bed'] = 1

In [141]:
# Replacing 10 with 1

df_3.loc[df_3['bed'] == 10, 'bed'] = 1

In [142]:
# Re-checking values

df_3['bed'].value_counts(dropna = False)

3    3930
4    2495
2     895
5     735
6     557
1     212
7     188
8     157
9     119
Name: bed, dtype: int64

In [144]:
# Check values of bathroom

df_3['bath'].value_counts(dropna = False)

2     3530
3     2438
1     1643
4      922
5      369
6      175
7       76
8       57
9       31
10      16
12       7
15       4
14       4
11       3
16       2
13       2
18       2
20       1
35       1
36       1
25       1
17       1
19       1
56       1
Name: bath, dtype: int64

I must do the same thing and fix the high count of bathrooms that are most likely typos.

In [152]:
# Change 56 bathroms to 5
df_3.loc[df_3['bath'] == 56, 'bath'] = 5

In [155]:
# Check listing for 35 bathrooms

df_3.loc[df_3['bath'] == 35]

,status,price,bed,bath,acre_lot,state,house_size,sold_date
14343,for_sale,13995000,3,35,0,Puerto Rico,15000,NaN

In [157]:
# Change 35 to 4 bathrooms

df_3.loc[df_3['bath'] == 35, 'bath'] = 4

In [159]:
# Change 36 to 4

df_3.loc[df_3['bath'] == 36, 'bath'] = 4

In [160]:
# Change 25 to 3 

df_3.loc[df_3['bath']  == 25, 'bath'] = 3

In [161]:
# Change 20 to 2 

df_3.loc[df_3['bath'] == 20, 'bath'] = 2

In [177]:
# Change 19 to 2

df_3.loc[df_3['bath'] == 19, 'bath'] = 2

In [178]:
# Change 18 to 2 

df_3.loc[df_3['bath'] == 18, 'bath'] = 2

In [179]:
# Change 17 to 2

df_3.loc[df_3['bath'] == 17, 'bath'] = 2

In [180]:
# Change 16 to 2 

df_3.loc[df_3['bath'] == 16, 'bath'] = 2

In [181]:
# Change 15 to 2 

df_3.loc[df_3['bath'] == 15, 'bath'] = 2

In [182]:
# Change 14 to 1

df_3.loc[df_3['bath'] == 14, 'bath'] = 1

In [183]:
# Change 13 to 1

df_3.loc[df_3['bath'] == 13, 'bath'] = 1

In [185]:
# Change 12 to 1

df_3.loc[df_3['bath'] == 12, 'bath'] = 1

In [186]:
# Change 11 to 1

df_3.loc[df_3['bath'] == 11, 'bath'] = 1

In [187]:
# Change 10 to 1

df_3.loc[df_3['bath'] == 10, 'bath'] = 1

In [189]:
# Re-checking values of bathrooms

df_3['bath'].value_counts(dropna = False)

2    3541
3    2439
1    1675
4     924
5     370
6     175
7      76
8      57
9      31
Name: bath, dtype: int64

In [190]:
# Check values of acre_lot

df_3['acre_lot'].value_counts(dropna = False)

0       6926
1        997
2        419
3        192
4        124
        ...
300        1
74         1
217        1
1261       1
109        1
Name: acre_lot, Length: 136, dtype: int64

In [191]:
# Check the acreage for entry 1261, seems extreme for a house

df_3.loc[df_3['acre_lot'] == 1261]

,status,price,bed,bath,acre_lot,state,house_size,sold_date
18814,for_sale,350000,4,2,1261,Puerto Rico,2820,NaN

In [193]:
# Change acreage to 12

df_3.loc[df_3['acre_lot'] == 1261, 'acre_lot'] = 12

In [194]:
# Check value of state

df_3['state'].value_counts(dropna = False)

Connecticut       2802
Massachusetts     2281
Rhode Island      1713
Puerto Rico       1521
New York           414
New Hampshire      325
Vermont            126
Virgin Islands     105
New Jersey           1
Name: state, dtype: int64

In [195]:
# Check value of house size

df_3['house_size'].value_counts(dropna = False)

1200    66
1500    62
2000    62
2500    49
960     48
        ..
1125     1
4224     1
1515     1
4080     1
1727     1
Name: house_size, Length: 3360, dtype: int64

In [196]:
# Check value count of sold date 

df_3['sold_date'].value_counts(dropna = False)

NaN           4932
10/18/2021       6
1/4/2022         6
12/1/2021        6
10/1/2021        6
              ...
10/16/2003       1
6/7/2010         1
7/11/2002        1
10/25/2002       1
8/1/1989         1
Name: sold_date, Length: 3160, dtype: int64

In [197]:
# Check shape 

df_3.shape

(9288, 8)

In [199]:
# Perform descriptive analysis again

df_3.describe()

              price          bed         bath       acre_lot    house_size
count  9.288000e+03  9288.000000  9288.000000    9288.000000  9.288000e+03
mean   5.891960e+05     3.707149     2.577196      16.583118  2.526759e+03
std    1.241282e+06     1.421407     1.325494    1045.715917  1.514505e+04
min    1.000000e+04     1.000000     1.000000       0.000000  1.810000e+02
25%    2.399000e+05     3.000000     2.000000       0.000000  1.296000e+03
50%    3.499435e+05     3.000000     2.000000       0.000000  1.870000e+03
75%    5.549250e+05     4.000000     3.000000       1.000000  2.856000e+03
max    6.000000e+07     9.000000     9.000000  100000.000000  1.450112e+06

In [200]:
df_3.describe().to_clipboard()

# Exports

In [220]:
# Exporting as csv file

df_3.to_csv(os.path.join(path, 'Data', 'Prepared Data', 'realtor-dataset-100k.csv'))

In [223]:
df_3.to_pickle(os.path.join(path, '03 Scripts', 'realtor-dataset-100k.pkl'))